insert into 注文 (注文日, 注文番号, 注文枝番, 商品コード, 数量, クーポン割引料)
	values (
		'2013-03-21', '201303210080',
		(
			select count(*)
				from 注文
				where	注文日 = '2013-03-21'
					and	注文番号 = '201303210080'
		) + 1,
		'S1003', 1, null
	)
;

insert into 注文 (注文日, 注文番号, 注文枝番, 商品コード, 数量, クーポン割引料)
	values (
		'2013-03-22', '201303220901',
		(
			select count(*)
				from 注文
				where	注文日 = '2013-03-22'
					and	注文番号 = '201303220901'
		) + 1,
		'S0052', 2, 500
	)
;


insert into 注文
	select	注文日, 注文番号, max(注文枝番) + 1, 'S1003', 1, null
		from 注文
		where	注文日 = '2013-03-21'
			and	注文番号 = '201303210080'
		group by 注文日, 注文番号
;

insert into 注文
	select	注文日, 注文番号, max(注文枝番) + 1, 'S0052', 2, 500
		from 注文
		where	注文日 = '2013-03-22'
			and	注文番号 = '201303220901'
		group by 注文日, 注文番号
